// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const NAME = '근영'
// - 나이(변수)
let age = 25
// - 학생 여부(상수)
const STUDENT_STATUS = true
// - 모든 정보를 한 번에 출력해보세요.
console.log(`이름 : ${NAME}, 나이 : ${age}, 학생 여부 : ${STUDENT_STATUS}`)

// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const NUMBER_1 = 1
// - 숫자2(상수)
const NUMBER_2 = 2
// - 결과(변수)
let result = NUMBER_1 + NUMBER_2

console.log('결괏값 : ', result)


// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const PRODUCT_NAME = '마우스'
// - 가격(변수)
let productPrice = 50_000
// - 재고 있음(변수)
let productInventory = true
// - 할인율(상수)
const DISCOUNT_RATE = 0.5